app/Modules/Auth/Models/CuentaModel.php

	public function get_permisos($id_usuario)
	{
		$consulta = $this->db->table("usuarios_permisos as up");
		$consulta->where('up.id_usuario', $id_usuario);

		$resultados = $consulta->get()->getResult();
---
SELECT *
FROM `usuarios_permisos` as `up`
WHERE `up`.`id_usuario` = '1'

	public function auth($data)
	{
		$this->usuarios->where("correo", $data["correo"]);
		$usuario = $this->usuarios->get()->getRowObject();
---
SELECT *
FROM `usuarios`
WHERE `correo` = 'esli@cebollaselESLIMX.com'


		// Actualizar el último login
		$this->usuarios->where('id_usuario', $usuario->id_usuario);
		$this->usuarios->update(['logged_at' => date('Y-m-d H:i:s')]);
---
UPDATE `usuarios` SET `logged_at` = '2024-07-31 10:21:37'
WHERE `id_usuario` = '1'

	public function verificar_bloqueo($correo, $ip_cliente)
	{
		$resultado = $this->db->table('usuarios_intentos_login')
			->where('correo', $correo)
			->where('ip_ultimo_intento', $ip_cliente)
			->get()
			->getRow();
---
SELECT *
FROM `usuarios_intentos_login`
WHERE `correo` = 'esli@cebollaselESLIMX.com'
AND `ip_ultimo_intento` = '::1'

	public function registrar_intento_fallido($correo, $ip_cliente)
	{
		$fila = $this->db->table('usuarios_intentos_login')
			->where('correo', $correo)
			->where('ip_ultimo_intento', $ip_cliente)
			->get()
			->getRow();

		if ($fila) {
			$intentos = $fila->intentos + 1;
			$datos = [
				'intentos' => $intentos,
				'ip_ultimo_intento' => $ip_cliente, // Guardar la IP del último intento
			];

			// Si se excede el número de intentos permitidos, se bloquea la cuenta
			if ($intentos >= 3) {
				$datos['bloqueado_hasta'] = date('Y-m-d H:i:s', strtotime('+5 minutes')); // Bloquear por 30 minutos
			}

			$this->db->table('usuarios_intentos_login')
				->where('correo', $correo)
				->where('ip_ultimo_intento', $ip_cliente)
				->update($datos);
		} else {
			// Primer intento fallido
			$this->db->table('usuarios_intentos_login')
				->insert([
					'correo' => $correo,
					'ip_ultimo_intento' => $ip_cliente,
					'intentos' => 1,
					'ultimo_intento' => date('Y-m-d H:i:s'),
				]);
---
SELECT *
FROM `usuarios_intentos_login`
WHERE `correo` = 'master'
AND `ip_ultimo_intento` = '::1'
UPDATE `usuarios_intentos_login` SET `intentos` = 3, `ip_ultimo_intento` = '::1', `bloqueado_hasta` = '2024-07-31 10:26:03'
WHERE `correo` = 'master'
AND `ip_ultimo_intento` = '::1'
INSERT INTO `usuarios_intentos_login` (`correo`, `ip_ultimo_intento`, `intentos`, `ultimo_intento`) VALUES ('esli@cebollaselESLIMX.com', '::1', 1, '2024-07-31 10:21:30')

	public function reiniciarIntentosFallidos($correo, $ip_cliente)
	{
		$this->db->table('usuarios_intentos_login')
			->where('correo', $correo)
			->where('ip_ultimo_intento', $ip_cliente)
			->update(['intentos' => 0, 'bloqueado_hasta' => null]);
---
UPDATE `usuarios_intentos_login` SET `intentos` = 0, `bloqueado_hasta` = NULL
WHERE `correo` = 'esli@cebollaselESLIMX.com'
AND `ip_ultimo_intento` = '::1'

	public function get_usuario($id_usuario, $id_empleado = '')
	{
		$usuarios = $this->db->table("usuarios");
		$usuarios->select('*');
		$usuarios->where("id_usuario", $id_usuario);
		$usuario = $usuarios->get()->getRowObject();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '1'

	public function cambiar_contrasena($cactual, $contrasena, $id_empleado = '')
	{
		//Verifica que la contraseña actual sea correcta
		if (!empty($this->session->id_usuario)) {
			$usuarios = $this->db->table("usuarios");
			$usuarios->where("id_usuario", $this->session->id_usuario);

			$usuarios->select("contrasena");
			$usuario = $usuarios->get()->getRowObject();

			if (password_verify($cactual, $usuario->contrasena)) {
				$data_password = [
					'contrasena' => password_hash($contrasena, PASSWORD_BCRYPT),
					'updated_at' => date('Y-m-d H:i:s'),
					'updated_by' => $this->session->id_usuario
				];

				$usuarios = $this->db->table("usuarios");
				$usuarios->where("id_usuario", $this->session->id_usuario);
				$usuarios->set($data_password);

				return $usuarios->update();;
---
SELECT `contrasena`
FROM `usuarios`
WHERE `id_usuario` = '1'
UPDATE `usuarios` SET `contrasena` = '$2y$10$1irWbbg9b8eFi86C6loDV.SNxxrzq3mf.C.hTJKql0SxIA/teYt0q', `updated_at` = '2024-07-30 14:29:18', `updated_by` = '1'
WHERE `id_usuario` = '1'