app/Filters/Auth.php

SELECT *
FROM `usuarios`
WHERE `id_usuario` = '1'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $logger = service('logger');
        $db = \Config\Database::connect();

        $ruta = $request->getUri()->getPath();

        // Definimos las rutas públicas y la ruta de salida
        $rutasPublicas = ['/cuenta', '/iniciar_sesion', '/login', '', '/', '/cuenta/post_login'];
        $rutaSalir = '/salir';
        $rutaPostContrasena = '/cuenta/cambiar_contrasena';

        if ($this->session->has('is_logged')) {
            $usuario = $db->table('usuarios')
                ->where('id_usuario', $this->session->get('id_usuario'))
                ->get()
                ->getRowObject();